app/views/pins/_form.erb

SELECT "categories".* FROM "categories"
---
		<label for="pin_category_id">Category:</label>
		<%= f.collection_select(:category_id, Category.all, :id, :name) %>