app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins" WHERE "pins"."slug" = $1 LIMIT 1  [["slug", "rails-tutorial"]]
---
  def show_by_name
  	@pin = Pin.find_by_slug!(params[:slug])

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @pin = Pin.find_by_id(params[:id])

INSERT INTO "pins" ("title", "url", "slug", "text", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Rails Wizard"], ["url", "http://railswizard.org"], ["slug", "rails-wizard"], ["text", "A fun and helpful Rails Resource"], ["category_id", 0]]
---
  def create
  	@pin = Pin.create(pin_params)

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
  	@pin = Pin.find_by_id(params[:id])

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "pins" SET "text" = $1 WHERE "pins"."id" = $2  [["text", "An interactive, in-browser tutorial for the Ruby programming language. A thorough walkthrough of     Ruby's nuances, geared toward beginners."], ["id", 3]]
---
  def update
  	@pin = Pin.find(params[:id])

  	if @pin.update(pin_params)